scripts/exp2/redis-sls-200-08.txt
====== PING_INLINE ======
  100000 requests completed in 2.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.02% <= 0.4 milliseconds
0.23% <= 0.5 milliseconds
5.30% <= 0.6 milliseconds
42.92% <= 0.7 milliseconds
85.96% <= 0.8 milliseconds
97.34% <= 0.9 milliseconds
98.48% <= 1.0 milliseconds
98.59% <= 1.1 milliseconds
98.62% <= 1.2 milliseconds
98.65% <= 1.3 milliseconds
98.70% <= 1.4 milliseconds
98.74% <= 1.5 milliseconds
98.78% <= 1.6 milliseconds
98.83% <= 1.7 milliseconds
98.88% <= 1.8 milliseconds
98.93% <= 1.9 milliseconds
98.98% <= 2.0 milliseconds
99.02% <= 2.1 milliseconds
99.02% <= 2 milliseconds
99.29% <= 3 milliseconds
99.31% <= 4 milliseconds
99.38% <= 5 milliseconds
99.54% <= 6 milliseconds
99.55% <= 8 milliseconds
99.55% <= 9 milliseconds
99.60% <= 10 milliseconds
99.60% <= 11 milliseconds
99.61% <= 12 milliseconds
99.74% <= 13 milliseconds
99.78% <= 14 milliseconds
99.80% <= 16 milliseconds
99.85% <= 17 milliseconds
99.87% <= 18 milliseconds
99.92% <= 19 milliseconds
99.95% <= 21 milliseconds
99.98% <= 22 milliseconds
100.00% <= 22 milliseconds
35778.18 requests per second

====== PING_BULK ======
  100000 requests completed in 2.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.09% <= 1 milliseconds
98.78% <= 2 milliseconds
99.20% <= 3 milliseconds
99.34% <= 4 milliseconds
99.44% <= 5 milliseconds
99.48% <= 6 milliseconds
99.51% <= 7 milliseconds
99.60% <= 8 milliseconds
99.65% <= 9 milliseconds
99.66% <= 10 milliseconds
99.70% <= 11 milliseconds
99.85% <= 12 milliseconds
99.90% <= 14 milliseconds
99.93% <= 15 milliseconds
99.95% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 19 milliseconds
36010.08 requests per second

====== SET ======
  100000 requests completed in 2.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.77% <= 1 milliseconds
98.79% <= 2 milliseconds
99.22% <= 3 milliseconds
99.28% <= 4 milliseconds
99.36% <= 5 milliseconds
99.40% <= 6 milliseconds
99.45% <= 7 milliseconds
99.46% <= 8 milliseconds
99.57% <= 9 milliseconds
99.65% <= 10 milliseconds
99.69% <= 11 milliseconds
99.80% <= 12 milliseconds
99.89% <= 13 milliseconds
99.92% <= 14 milliseconds
99.95% <= 15 milliseconds
99.98% <= 16 milliseconds
100.00% <= 16 milliseconds
35385.70 requests per second

====== GET ======
  100000 requests completed in 2.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.53% <= 1 milliseconds
98.89% <= 2 milliseconds
99.26% <= 3 milliseconds
99.35% <= 4 milliseconds
99.49% <= 5 milliseconds
99.58% <= 6 milliseconds
99.62% <= 7 milliseconds
99.65% <= 8 milliseconds
99.66% <= 9 milliseconds
99.71% <= 10 milliseconds
99.75% <= 11 milliseconds
99.85% <= 12 milliseconds
99.90% <= 16 milliseconds
99.94% <= 17 milliseconds
99.97% <= 18 milliseconds
100.00% <= 18 milliseconds
35348.18 requests per second

====== INCR ======
  100000 requests completed in 2.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.26% <= 1 milliseconds
98.91% <= 2 milliseconds
99.28% <= 3 milliseconds
99.37% <= 4 milliseconds
99.47% <= 5 milliseconds
99.51% <= 6 milliseconds
99.65% <= 7 milliseconds
99.73% <= 8 milliseconds
99.75% <= 9 milliseconds
99.77% <= 10 milliseconds
99.80% <= 11 milliseconds
99.89% <= 12 milliseconds
99.90% <= 16 milliseconds
99.96% <= 17 milliseconds
100.00% <= 17 milliseconds
35945.36 requests per second

====== LPUSH ======
  100000 requests completed in 2.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.05% <= 1 milliseconds
98.89% <= 2 milliseconds
99.33% <= 3 milliseconds
99.39% <= 4 milliseconds
99.48% <= 5 milliseconds
99.55% <= 6 milliseconds
99.55% <= 7 milliseconds
99.56% <= 8 milliseconds
99.61% <= 9 milliseconds
99.65% <= 11 milliseconds
99.78% <= 12 milliseconds
99.80% <= 16 milliseconds
99.82% <= 17 milliseconds
99.91% <= 18 milliseconds
99.95% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
35778.18 requests per second

====== RPUSH ======
  100000 requests completed in 2.90 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.44% <= 1 milliseconds
98.44% <= 2 milliseconds
99.09% <= 3 milliseconds
99.17% <= 4 milliseconds
99.22% <= 5 milliseconds
99.22% <= 6 milliseconds
99.26% <= 7 milliseconds
99.27% <= 10 milliseconds
99.28% <= 11 milliseconds
99.46% <= 12 milliseconds
99.61% <= 13 milliseconds
99.74% <= 14 milliseconds
99.75% <= 16 milliseconds
99.80% <= 17 milliseconds
99.88% <= 18 milliseconds
99.90% <= 20 milliseconds
99.92% <= 21 milliseconds
99.97% <= 22 milliseconds
100.00% <= 22 milliseconds
34506.55 requests per second

====== LPOP ======
  100000 requests completed in 2.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.65% <= 1 milliseconds
98.62% <= 2 milliseconds
99.29% <= 3 milliseconds
99.30% <= 9 milliseconds
99.35% <= 11 milliseconds
99.47% <= 12 milliseconds
99.65% <= 14 milliseconds
99.68% <= 15 milliseconds
99.79% <= 16 milliseconds
99.85% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
34770.52 requests per second

====== RPOP ======
  100000 requests completed in 2.87 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.47% <= 1 milliseconds
98.61% <= 2 milliseconds
99.26% <= 3 milliseconds
99.31% <= 4 milliseconds
99.43% <= 5 milliseconds
99.50% <= 6 milliseconds
99.50% <= 7 milliseconds
99.55% <= 8 milliseconds
99.60% <= 9 milliseconds
99.60% <= 11 milliseconds
99.64% <= 12 milliseconds
99.70% <= 13 milliseconds
99.75% <= 18 milliseconds
99.76% <= 19 milliseconds
99.80% <= 21 milliseconds
99.89% <= 22 milliseconds
100.00% <= 22 milliseconds
34879.66 requests per second

====== SADD ======
  100000 requests completed in 2.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.93% <= 1 milliseconds
98.46% <= 2 milliseconds
99.12% <= 3 milliseconds
99.33% <= 4 milliseconds
99.37% <= 5 milliseconds
99.39% <= 6 milliseconds
99.43% <= 7 milliseconds
99.45% <= 11 milliseconds
99.60% <= 12 milliseconds
99.65% <= 14 milliseconds
99.72% <= 15 milliseconds
99.75% <= 17 milliseconds
99.88% <= 18 milliseconds
99.90% <= 21 milliseconds
99.94% <= 22 milliseconds
100.00% <= 22 milliseconds
34722.22 requests per second

====== HSET ======
  100000 requests completed in 2.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.41% <= 1 milliseconds
98.75% <= 2 milliseconds
99.27% <= 3 milliseconds
99.35% <= 5 milliseconds
99.37% <= 6 milliseconds
99.48% <= 7 milliseconds
99.50% <= 8 milliseconds
99.53% <= 9 milliseconds
99.69% <= 10 milliseconds
99.78% <= 11 milliseconds
99.80% <= 12 milliseconds
99.87% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
34036.76 requests per second

====== SPOP ======
  100000 requests completed in 2.77 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.97% <= 1 milliseconds
98.89% <= 2 milliseconds
99.29% <= 3 milliseconds
99.38% <= 4 milliseconds
99.49% <= 5 milliseconds
99.55% <= 6 milliseconds
99.63% <= 7 milliseconds
99.68% <= 8 milliseconds
99.72% <= 9 milliseconds
99.75% <= 11 milliseconds
99.91% <= 12 milliseconds
99.95% <= 17 milliseconds
99.97% <= 18 milliseconds
100.00% <= 18 milliseconds
36049.03 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.78% <= 1 milliseconds
98.72% <= 2 milliseconds
99.25% <= 3 milliseconds
99.25% <= 5 milliseconds
99.33% <= 6 milliseconds
99.35% <= 11 milliseconds
99.43% <= 12 milliseconds
99.55% <= 13 milliseconds
99.60% <= 14 milliseconds
99.68% <= 15 milliseconds
99.70% <= 17 milliseconds
99.73% <= 18 milliseconds
99.80% <= 21 milliseconds
99.88% <= 22 milliseconds
100.00% <= 22 milliseconds
34662.05 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.51 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

91.86% <= 1 milliseconds
98.13% <= 2 milliseconds
98.98% <= 3 milliseconds
99.11% <= 4 milliseconds
99.18% <= 5 milliseconds
99.23% <= 6 milliseconds
99.24% <= 7 milliseconds
99.30% <= 8 milliseconds
99.35% <= 9 milliseconds
99.35% <= 11 milliseconds
99.45% <= 12 milliseconds
99.65% <= 13 milliseconds
99.70% <= 14 milliseconds
99.74% <= 15 milliseconds
99.77% <= 16 milliseconds
99.85% <= 17 milliseconds
99.90% <= 18 milliseconds
99.90% <= 21 milliseconds
99.95% <= 22 milliseconds
100.00% <= 22 milliseconds
28498.15 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.08% <= 1 milliseconds
96.86% <= 2 milliseconds
97.65% <= 3 milliseconds
98.29% <= 4 milliseconds
98.61% <= 5 milliseconds
98.69% <= 6 milliseconds
98.79% <= 7 milliseconds
98.88% <= 8 milliseconds
98.93% <= 9 milliseconds
98.97% <= 10 milliseconds
98.99% <= 11 milliseconds
99.04% <= 12 milliseconds
99.19% <= 13 milliseconds
99.35% <= 14 milliseconds
99.45% <= 15 milliseconds
99.50% <= 16 milliseconds
99.55% <= 17 milliseconds
99.60% <= 18 milliseconds
99.64% <= 19 milliseconds
99.65% <= 20 milliseconds
99.68% <= 21 milliseconds
99.75% <= 22 milliseconds
99.88% <= 23 milliseconds
99.97% <= 24 milliseconds
100.00% <= 24 milliseconds
17289.07 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
97.65% <= 2 milliseconds
99.23% <= 3 milliseconds
99.38% <= 4 milliseconds
99.51% <= 5 milliseconds
99.57% <= 6 milliseconds
99.64% <= 7 milliseconds
99.67% <= 8 milliseconds
99.69% <= 9 milliseconds
99.71% <= 10 milliseconds
99.72% <= 11 milliseconds
99.74% <= 12 milliseconds
99.79% <= 13 milliseconds
99.82% <= 14 milliseconds
99.84% <= 15 milliseconds
99.85% <= 17 milliseconds
99.86% <= 18 milliseconds
99.88% <= 19 milliseconds
99.90% <= 20 milliseconds
99.93% <= 21 milliseconds
99.94% <= 22 milliseconds
99.95% <= 23 milliseconds
99.96% <= 24 milliseconds
99.98% <= 25 milliseconds
99.99% <= 26 milliseconds
100.00% <= 27 milliseconds
100.00% <= 27 milliseconds
14088.48 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 8.05 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
55.81% <= 2 milliseconds
98.92% <= 3 milliseconds
99.95% <= 4 milliseconds
99.98% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
12422.36 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.57% <= 1 milliseconds
99.88% <= 2 milliseconds
99.93% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 5 milliseconds
37064.49 requests per second